package co.health.test.corona.screen.utils

object Constants {
    const val guideVasvas = """اختلال وسواس فکری-عملی یک اختلال اضطراب است که مشخصه‌ی آن افکار غیرقابل کنترل و ناخواسته و الگوهای مکرر رفتاری است که شما برای انجام آنها احساس اجبار می‌کنید. افکار و رفتارهای وسواس‌‌گونه‌ی غیرمنطقی است، با وجود این،  فرد برای مقاومت در برابر این مشکل و رهایی از آن، احساس ناتوانی می‌کند."""
    const val guideAfsordegi = """افسردگی حالت خلقی شامل بی‌حوصلگی و گریز از فعالیت یا بی‌علاقگی و بی‌میلی است و می‌تواند بر روی افکار، رفتار، احساسات و خوشی و تندرستی یک فرد تأثیر بگذارد. افرادی که دارای حالت افسردگی هستند، می‌توانند احساس ناراحتی، پوچی، ناامیدی، درماندگی، بی‌ارزشی، شرمساری یا بی‌قراری داشته باشند. ممکن است آن‌ها اشتیاق خود در انجام فعالیت‌هایی که زمانی برایشان لذت‌بخش بوده از دست بدهند، نسبت به غذا بی‌میل و کم‌اشتها شوند، تمرکز خود را از دست بدهند، در به خاطر سپردن جزئیات و تصمیم‌گیری دچار مشکل شوند."""
    const val guideEzterab = """اضطراب عبارت است از یک احساس منتشر، ناخوشایند و مبهم هراس و نگرانی با منشأ ناشناخته، که به فرد دست می‌دهد و شامل عدم اطمینان، درماندگی و برانگیختگی فیزیولوژی است. وقوع مجدد موقعیت‌هایی که قبلاً استرس زا بوده‌اند یا طی آن‌ها به فرد آسیب رسیده‌است باعث اضطراب در افراد می‌شود. همه ی انسان‌ها در زندگی خود دچار اضطراب می‌شوند، ولی اضطراب مزمن و شدید غیرعادی و مشکل‌ساز است"""

    const val guideZanashoi = """تعارض به طور طبيعي درتمام زمينه‌هاي شغلي،تحصيلي،خانوادگي،ازدواج و درسطح فردي وجمعي روي مي‌دهد. روابط خانوادگي فشرده‌ترين موقعيت براي تعارضات بين فردي است. روابط عاطفي وعاشقانه زمينه رابراي محک زدن جدي مهارتهاي آموخته شده براي زندگي مهيا مي‌کنند. در ارتباط بين افراد تعارض وقتي بروز مي‌كند كه فرد بين اهداف،نيازها،يا اميال شخصي خودش و اهداف،نيازها و اميال شخصي طرف مقابلش ناهمسازي و ناهمخواني مي‌بيند بروز اختلاف و عدم تفاهم درخانواده امری شایع است و هیچ خانواده‌ای از این امر مستثنی نیست، اما گاهی این اتفاقات به تعارض‌های شدید منجر می‌شود. نهادی که وظیفه اصلی آن ایجاد روحیه وشخصیت سالم است خود به عاملی برای اختلالات عاطفی،رفتاری وشخصیتی تبدیل شده است"""
    const val karamad ="""شما وقتی در شرایط استرس زا قرار میگیرد معمولا سعی در ارزیابی درست از مسئله داشته و کمتر دچار هیجان زدگی می شوید . شرایط را پذیرفته و درجهت تغییر آن فکر می کنید . برنامه ریزی جهت گذر از بحران کرده و رو گام های بعدی فکر میکنید .زوایای مثبت رویداد را کشف کرده و به عنوان یک تجربه از آن استفاده  می کنید."""
    const val nakaramad ="""شما وقتی در شرایط پر ابهام قرار میگیرید ، اغلب نمیتوانید هیجان های خود را به خوبی و درستی مدیریت کنید . برخی اوقات بیش برآورد شما از حادثه باعث می شود دچار اضطراب شوید. معمولا زمانی که در بحران قرار میگیرید افکار تکرار شونده در ذهن شما بیشتر می شود .گاهی اوقات خود را مسبب وضعیت پیش آمده و گاهی دیگران را مسبب و مسول آن می دانید . این تفکرات در دراز مدت با عث آسیب به سلامت روان شما خواهد شد."""
    const val sabkTakaneshiHalMasale = """سبک حل مسئله تکانشی : مسائل مختلف اجتماعی و روابط بین فردی را شتاب زده و بدونه در نظر گرفتن مولفه های مختلف آن بررسی کرده و اقدام به تصمیم گیری می کنید. شما تصمیم گیری در موقعیت های اجتماعی  سریع بدون در نظر گرفتن عواقب تصمیم گرفته شده عمل می کنید.این رفتار باعث خواهد شد ضریب خطای شما در تصمیم گیری بسیار بالا رفته و روابط اجتماعی و روابط بین فردی شما را تهدید کند."""
    const val sabkEjtenabiHalMasale = """سبک حل مسئله اجتنابی : شما در موقعیت های اجتماعی و روابط بین فردی اگر به مسئله برخورد کنید معمولا اولین راه حلی که به ذهن شما می رسد دوری از آن و مشکلات است .این رفتار در شما باعث بی تصمیمی و بلاتکلیفی در عمل شود .درنتیجه در دراز مدت جلوی پیشرفت های فردی ما را میگیرد."""
    const val sabkManteghiHalMasale="""سبک حل مسئله منطقی: شما در موقعیت های اجتماعی تمام جوانب یک مسئله را سنجیده و به دقت تجزیه و تحلیل انجام می دهید و معمولا امکان های جایگزین را نیز در نظر گرفته و به آن می پردازید .این رفتارشما باعث می شود همیشه چندین راه حل برای یک مسئله داشته باشید . در نتیجه معمولا تصمیمات شما کمتر با شکست مواجه می شود ."""
    const val ezterab ="""اضطراب، نوعی اختلال در سلامت روانی انسان است. افراد مبتلا به اضطراب اغلب با نگرانی‌ های غیر ارادی، ترس‌ های غیر منطقی، اختلال در تعاملات اجتماعی و… دست‌ و‌ پنجه نرم می‌کنند. 
گاهی‌ اوقات، اندکی اضطراب واقعا لازم و ضروری است؛ مثلا داشتن اندکی اضطراب به خاطر آزمونی که پیش‌ِ رو دارید، شما را وا می‌دارد تا با احساس مسئولیت بیشتری درس بخوانید، کمی نگرانی پیش از تصمیم‌ های حساس زندگی‌تان، مانند ازدواج و انتخاب شغل، شما را به هوشیاری و تمرکز بیشتری به هنگام تصمیم‌گیری مجهز می‌کند. اما بدیهی است هرچیزی که از حد طبیعی‌ اش فراتر رود، زیان‌بار و خطرناک می‌شود. شوربختانه، زندگی پرشتاب و ماشینی این‌روزها، اضطراب را در شمار بسیاری از افراد از کنترل خارج کرده و آن را به شایع‌ ترین اختلال روانی در میان انسان‌ های امروز بدل کرده است. 
هرکسی اضطراب را به‌ گونه‌ ای متفاوت تجربه می‌کند. برخی افراد، اختلال اضطراب فراگیر دارند که قابل کنترل است
•	استرس و اضطراب جزو احساسات رایجی است که شاید در طول زندگی بارها تجربه کنیم. 
•	اما هنگامی که استرس شدید، قوی و از کنترل خارج شود، می‌تواند مشکلاتی را در سلامت روحی و جسمی ما ایجاد کند. 
•	به همین دلیل یافتن راه‌های کاهش استرس و اضطراب برای بازگرداندن آرامش روحی و سلامت جسمی لازم است. ولی پیدا کردن یک داروی ضد استرس که در هر شرایطی برای شما مناسب باشد، آسان نیست. 
•	فهرستی که در اینجا برای شما تهیه کردیم، مجموعه‌ای کامل از روش‌های مختلف برای رسیدن به آرمش درونی و یک زندگی ضد استرس و تنش است.


*	ورزش کردن 
ورزش یکی از بهترین راه‌های کاهش استرس است. 
ایجاد استرس فیزیکی در بدن با استفاده از ورزش، باعث کاهش استرس ذهنی می‌شود.
ورزش باعث کاهش هورمون‌های استرس‌ بدن 

*	بهداشت خواب
مشخص بودن ساعت بخواب رفتن
زمان خواب 8-7 مطلوب است 
حتی الامکان بعد از بیداری استحمام صورت پذیرد

*	-نوشتن
یکی از راه‌های کاهش استرس نوشتن است. ثبت کردن آن‌چه که باعث استرس شما شده مرحله اول است. 
بعد از آن نوشتن آن‌چه که از داشتن‌ آن راضی هستید و قدردانی از آن در قالب می‌تواند مفید باشد. حس قدردانی می‌تواند با جهت دادن ذهن‌تان به سمت چیزهای مثبتی که در زندگی دارید، به طرز عجیبی باعث کاهش استرس شود.

*	کم کردن مصرف کافئین
کافئین موجود در قهوه، شکلات، چای و نوشیدنی‌های انرژی‌زا در میزان زیاد می‌توانند باعث استرس و اضطراب شوند. افراد ظرفیت‌های مختلفی برای مصرف کافئین دارند. اگر متوجه شدید که کافئین شما را عصبی و مضطرب می‌کند، به فکر قطع کردن آن باشید.

*	آدامس جویدن
یک راه ساده و سریع برای کاهش استرس، آدامس جویدن است. تحقیقاتی در این زمینه نشان داد افرادی که آدامس می‌جوند در کنترل آرامش ذهن خود موفق‌تر هستند و استرس کمتری دارند. یک توضیح منطقی برای این موضوع این است که جویدن آدامس باعث می‌شود موج‌های مغز فرد شبیه موج‌های مغز افراد آرام می‌شود. دلیل دیگر این است که جویدن آدامس باعث افزایش جریان خون به مغز می‌شود. یک تحقیق دیگر که به تازگی انجام شده است نشان می‌دهد میزان کاهش استرس هنگامی که افراد آدامس خود را با قدرت بیشتر می‌جوند، بیشتر هم می‌شود.

*	وقت گذراندن با دوستان و خانواده
حمایت اجتماعی از طرف دوستان و خانواده می‌تواند کمک کند از شرایط استرس‌زا ساده‌تر عبور کنیم. یکی از تحقیقات به این نتیجه رسید که زمان‌های مشخصی که زنان با دوستان‌شان و بچه‌ها صرف می‌کنند، باعث ترشح اوکسیتوسین (Oxytocin) می‌شود که یک ضد استرس طبیعی است. 

*	گفتن نه 
چیزهای استرس‌زا قابل کنترل نیستند اما برخی از آن‌ها چرا! کنترل آن بخش از زندگی‌تان را که باعث استرس شما می‌شود و می‌توانید آن را تغییر دهید، در دست بگیرید. معمولا یکی از راه‌های جلوگیری از شرایط استرس‌زا «نه گفتن» است. این کار واقعا می‌تواند در پیشگیری از استرس کمک کند، خصوصا اگر برخی از مواقع خودتان را در حالتی پیدا می‌کنید که در حال تحمل چیزی هستید که بیشر از حد تحمل شماست. مثل برداشتن مسئولیت‌های بیش از حد که می‌تواند باعث غرق شدن شما شود.

*	عقب نینداختن کارها
یک راه دیگر برای به دست آوردن کنترل روی استرس این است که اولویت‌های خود را مشخص کنید و عقب انداختن کارها را متوقف کنید. به تعویق انداختن کارها شما را به سمت واکنشی رفتار کردن هدایت می‌کند و در حال تقلا کردن برای رسیدن رها می‌کند. این موضوع می‌تواند باعث استرس و تاثیرات منفی روی سلامتی و کاهش کیفیت خواب شود.به تهیه یک لیست برای کارها و طبقه‌بندی کردن‌شان بر اساس اولویت عادت کنید. برای خود اهداف واقعی تعیین کنید و تمرکز خود را از روی لیست برندارید.

*	رفتن به کلاس یوگا
یوگا چند سالی است که تبدیل به یک متد موثر در کاهش استرس و یک ورزش عالی برای تمام سنین شده است. با این‌که یوگا سبک‌های مختلفی دارد اما یک هدف واحد را دنبال می‌کند؛ ارتباط موثر میان ذهن و جسم.برخی از مطالعات روی تاثیر یوگا بر سلامت ذهن تمرکز کرده‌اند. به صورت کلی تحقیقات به این نتیجه رسید که یوگا می‌تواند روحیه را تقویت کند و حتی مانند یک داروی ضد افسردگی، در درمان افسردگی و اضطراب موثر باشد. 

*	تخته‌ی چشم‌انداز درست کنید
اگر آینده در نظرتان بزرگ و ترسناک است، سعی کنید افکار خود در خصوص اتفاقات آینده را تغییر دهید. گاهی‌ اوقات تعیین اهداف واقعی می‌تواند ما را از اضطراب در خصوص آینده‌ي ناشناخته دور کند. یک ساعت از وقت خود را برای ساختن یک تخته‌ی چشم‌انداز کنار بگذارید و در این تخته هیجانات خود درباره‌ی پروژه‌ها و اتفاقات احتمالی پیشِ رو را وارد کنید. کسانی که نمی‌توانند این تخته را به صورت دستی تهیه کنند، می‌توانند با استفاده از شبکه اجتماعی پینترست (Pinterest) برای خودشان تخته‌ی چشم‌انداز الکترونیکی بسازند. 

*	از پیش برنامه‌ریزی کنید
با آماده نمودن خود برای روزهای پیشِ رو، با افکار اضطراب‌آور مبارزه کنید. سعی کنید یک برنامه‌ی زمان‌بندی یا یک لیست فعالیت‌ها درست کنید و عاداتی را در خود ایجاد نمایید که به افزایش بهره‌وری منجر می‌شود. به جای صرف روزانه ۱۰ دقیقه‌‌ بیشتر برای پیدا کردن دسته‌ کلید، عادت کنید که هر روز هنگام ورود به خانه آن را در جایی مشخص بگذارید. شب قبل لباس‌های خود را در جایی کنار بگذارید، ساک ورزشی خود را جمع کنید و آن را پشت در قرار دهید یا زودتر به فکر تهیه‌ی ناهار بیافتید. بر این تمرکز داشته باشید که چگونه با کسب آمادگی پیش از موعد، باورهای اضطراب‌آور را از ذهن خود دور بریزید.

*	تمرین تنفس برای آرامش در کمتر از ۱۰ دقیقه
       برای سالم ماندن باید در بدن تعادل ایجاد شود و این تعادل با تنفس کلید می‌خورد. یکی از تمریناتِ پرانایاما           (کنترل نفس) تمرین تنفس یکسان است که در آن، مدت زمان دم و بازدم با هم برابر بوده و هر کدام تا ۴ شماره طول می‌کشد و این تنفس از طریق بینی انجام می‌شود. تنفس از طریق بینی، اصطکاکی طبیعی در برابر جریان هوا ایجاد می‌کند
بهترین زمان برای انجام این روش: در هر لحظه و در هر کجا می‌توان این تمرین را انجام داد اما انجام آن پیش از خواب اثر قابل توجهی دارد. 
تمرین تنفس شکمی
یک دست را روی قفسه سینه و دست دیگر را بر روی شکم خود بگذارید. از طریق بینی نفس عمیق بکشید. برای ایجاد کشش در شش‌ها، دیافراگم کاملا به وسیله‌ی هوا منبسط شود، هدف ما در این روش، ۶ تا ۱۰ نفس عمیق و آرام در هر دقیقه است که به مدت ۱۰ دقیقه در هر روز برای کاهش سریع ضربان قلب و فشار خون انجام می‌شود». این تمرین را برای ۶ تا ۸ هفته انجام دهید و از اثرات آن در درازمدت بهره ببرید.

 
. 
آرام‌سازی عضلات: مکان آرامی پیدا کنید. چشمان خود را ببندید و به آرامی فشار دهید، سپس هر یک از گروه‌های عضلانی از انگشتان پا تا سر خود را شل کنید. به مدت سه ثانیه فشار را نگه دارید و سپس خیلی سریع آنرا رها کنید. این کار می‌تواند به کاهش احساس فشار ماهیچه‌ای که ناشی از اضطراب است کمک کند و یکی از راه های درمان اضطراب است.

*	کارهای شجاعانه کوچک انجام دهید. 
اجتناب و دروی از آنچه که شما را مضطرب می‌کند، در کوتاه مدت موجب تسکین اضطراب شما می‌شود، اما می‌تواند در طولانی مدت شما را بیشتر مضطرب کند. سعی کنید به چیزهایی که شما را مضطرب می‌کنند، فکر کنید. با انجام این کار متوجه خواهید شد، چیزی که از آن می‌ترسید احتمالا اتفاق نمی‌افتد، و حتی اگر هم رخ دهد، توانایی مقابله با آن را خواهید داشت. 

*	طرز فکر خود را تغییر دهید.
 طرز فکر شما بر احساسات شما تاثیر دارد. اضطراب می‌تواند خطری را بیش از حد بزرگ جلوه داده و توانایی شما برای مدیریت آنرا کم ارزیابی کند. سعی کنید از شرایطی که شما را مضطرب می‌کنند (به جای آنکه به بدترین سناریو فکر کنید) تفسیرهای متفاوتی داشته باشید. به واقعیت‌ها و اینکه خلاف افکار شما حقیقت دارد، فکر کنید. 
*	درباره اضطراب خود، آگاه باشید. 
دفتر خاطرات روزانه‌ای درباره اینکه چه زمانی بهترین وضعیت و چه زمانی بدترین وضعیت روحی شما است، داشته باشید. الگوهای ایجاد اضطراب خود را پیدا کنید و برای مدیریت اضطراب به صورت هفتگی یا روزانه برنامه‌ریزی کنید. این مورد یکی از راه های درمان اضطراب است که کمک زیادی به شما خواهد کرد.
"""
const val afsordegi = """افسردگی می تواند ناتوان کننده باشد و بسیار فراتر از یک حس نارضایتی عمل کند. معمولا, همیشه دلیلی برای ناراحتی مانند ترد شدن و یا بدست نیاوردن کار مورد علاقه وجود دارد.
 ذهن افسرده تمایل دارد تا همه چیز را اشتباه ببیند و نگرانی های بی فایده ای در مورد تمامی احتمالات منفی که ممکن است در آینده اتفاق بیافتد داشته باشد. 
این چرخه تفکر منفی بدبختی فرد را تقویت می کند و در مدیریت غلبه بر افسردگی اصلا مفید نیست. 

*	رفتن به یک کلاس ورزشی و فعالیت بدنی شدید یا پیاده‌روی در خیابان‌هایی که احساس خوبی نسبت به آنها دارید و نوشتن است که در روحیه شما بسیار تاثیر گذار می‌باشد.
*	تغییر سبک زندگی یکی از ساده‌ترین و درعین‌حال مهم‌ترین و کاربردی‌ترین روش های درمان افسردگی است. حتی سایر روش های درمان نیز در سایه‌ی تغییر سبک زندگی بهتر عمل خواهند کرد. گاهی‌ اوقات تغییر سبک زندگی و حال‌وهوای فرد بیمار اصلا باعث می‌شود که به دارو و سایر روش های درمان افسردگی نیازی نباشد.
*	به آنچه در اطرافتان می‌گذرد، توجه نکنید و خوش باشید
اگر دچار افسردگی شده‌اید باید بدانید که برای درمان افسردگی‌ نباید به اطراف توجه کنید .اگر بی‌حوصله هستید هیچ چیز دیگری به‌غیر از شادی نمی‌تواند شما را از این حالت خارج کند. پس به به آنچه در اطرافتان می‌گذرد، توجه نکنید و سعی در پیدا کردن نکات مثبت و شادی آور محیط  باشید.بپذیرید که احساس پریشانی زودگذر است .
*	پر جنب و جوش باشید
با قدم زدن و غصه خوردن در خانه، افسرده‌تر هم می‌شوید. پس توصیه می‌کنیم از خانه بیرون بروید و کاری را که دوست دارید، با جنب و جوش انجام بدهید. می‌توانید پیاده‌روی یا دوچرخه سواری کنید. به یکی از دوستان خود سر بزنید. شطرنج بازی کنید. مطالعه کنید. یا فقط نقش یک فرد نیکوکار را به خود بگیرید.
*	خودتان را سرگرم کنید
فکر کنید ببینید انجام چه کارهایی شما را سرگرم می‌کند. بهترین راه این است که فعالیت‌های مورد علاثه خود را روی کاغذ بنویسید، البته مساله این است که هنگام ناراحتی و بی‌حوصلگی هیچ کاری لذت بخش نیست.فهرستی از فعالیت‌هایی که قبلاً از انجام آن‌ها لذت می‌بردید را تهیه کنید. پس از آن یکی از آن‌ها را انتخاب کنید و انجام دهید.
*	هم صحبت پیدا کنید
صحبت کردن با دیگران و بیان احساسات شخصی همیشه به شما کمک می‌کند تا احساس خوبی داشته باشید. دوستانی را برای صحبت کردن انتخاب کنید که به شما توجه داشته باشند و با آن‌ها درد دل کنید
*	خوب گریه کنید
اگر صحبت از مشکلات باعث بغض شما می‌شود، خوب گریه کنید. گریه شما را کاملاً راحت می‌کند. مخصوصاً اگر علت آن را بدانید.
*	دلیل افسردگی را پیدا کنید
وضعیت خود را با دقت بررسی کرده و در صدد رفع مشکل خود باشید. در بسیاری از مواقع اگر منشأ افسردگی خود را درست تشخیص بدهید، احساس شما خیلی بهتر خواهد شد. وقتی مشکل خود را می‌دانید، می‌توانید اقدامات لازم را برای رفع آن انجام دهید.
*	تلاش کنید ولی واقع بین باشید
اگر تلاش کردید ولی نتیجه نداد، کار دیگری را شروع کنید. دنبال کردن اهداف نامشخص می‌تواند، موجب افسردگی شود. در این شرایط فقط می‌توانید بگویید: نهایت آنچه از دستم بر می‌آمد، انجام دادم و دیگر آن را انجام ندهید.

*	نقاشی بکشید
یکی از بهترین راه‌های بیرون ریختن احساسات نوشتن آن‌ها بر روی کاغذ و یا حتی بهتر از آن نقاشی کردن آن‌ نقاشی کردن آن‌هاست. اگر پس از این که چیزی شما را ناراحت کرد، فوراً بنشینید و شروع کنید به نقاشی کردن، از احساسی که به شما دست می‌دهد، تعجب خواهید کرد. از رنگ‌های مختلف استفاده کنید
*	تصمیم مهم نگیرید
هنگامی که افسرده هستید، اصلاً نمی‌توانید قدرت تشخیص خوبی داشته باشید. تصمیم‌های مهم زندگی را بگذارید برای زمانی که حالتان بهتر شد. در غیر این صورت تصمیم اشتباه می‌گیرید. که بدون شک باعث ناراحتی بیشتر شما می‌شود.
*	سراغ یخچال نروید
خوردن زیاد هم نتیجه عکس می‌دهد. شاید در لحظه خوردن احساس شما خوب باشد. ولی وقتی که شکم و چربی بیاورید باعث افسردگی شما می‌شود. اگر نمی‌توانید جلو شکم خود را بگیرید، برای مقابله با پرخوری از خانه بیرون بزنید..

*	گوش دادن به موسیقی ملایم برای رهایی از افسردگی
موسیقی ملایم می تواند فضا را فورا تغییر بدهد و جو مثبتی ایجاد کند. گوش دادن به موسیقی شاد تغییرات شیمیایی در مغز ایجاد می کند و می تواند خلق و خوی تان را بهبود بخشد.

 
*	زمزمه های منفی را متوقف کنید
افراد افسرده تمایل دارند که دنیا را به دید منفی ببینند. وقتی کارها اشتباه پیش می رود خودشان را سرزنش می کنند و وقتی که کارها طبق میلشان بود آنرا به پای بخت و اقبالشان می نویسند. افسردگی به شک دامن می زند و احساس بی ارزشی را تقویت می کند. گفته های منفی درونیتان را مدام پیگیری کنید و به خودتان یادآوری کنید که این طرز فکر یک فرد افسرده است, نه فردی با عملکرد سالم. وقتی که احساس خوبی ندارید افکارتان را جدی نگیرید. این افکار را بشناسید و درک کنید اما آنها را باور نکنید.
قبول کنید که حالت ذهنی تان بطور کامل متعادل نیست. در حین افسردگی, منفی نگری ما نسبت به همه چیز افزایش می یابد و یافتن تعادل در مورد چیزی که در جریان است سخت تر می شود. به خودتان یادآوری کنید که بروی کانال منفی تنظیم شده اید و به افکارتان گوش ندهید. وقتی افسرده هستید همه چیز را تحریف می کنید. زمانی که جهان تاریک و دلگیر به نظر می رسد این ایده به تنهایی می تواند کمی آسایش فراهم کند. 
.
*	نور خورشید بیشتری دریافت کنید
اختلالات عاطفی فصلی (SAD) باعث کاهش سطح خلق و خویتان به دلیل کاهش نور آفتاب می شود. گرفتن حمام آفتاب کوتاه و ملایم ۳ مرتبه در روز می تواند بسیار به شما کمک کند. علائم SAD می تواند شامل مشکلات خواب، اضطراب، افسردگی، تحریک پذیری، خستگی، بی تفاوتی باشد و استفاده از نور به غلبه بر افسردگی کمک می کند و این علائم را کاهش می دهد.
*	از الكل پرهيز كنيد
در مقابل تمايل مصرف الكل، برای سر پوش گذاشتن  و فراموش کردن غمهایتان ، مقاومت كنيد، الكل افسردگی را واقعاً بدتر می ‌كند، چند ساعتی حس بهتری به شما   می ‌دهد ولی بعداً حس افسردگی بدتری دوباره باز می‌گردد. مصرف خيلی زياد الكل ،شما را از درخواست كمك و حل مشكلتان باز می ‌دارد. در ضمن برای سلامت جسمانی شما نيز مضر است
 
"""
const val vasvas ="""وسواس را می توان یك ایده، فكر، تصور، احساس یا حركت مكرر یا مضردانست كه با احساس اجبار و وعلاقه به مقاومت در برابر آن همراه است. فرد متوجه غیرعادى و نابهنجار بودن رفتار خود است.
یکی از دلایل ابتلا به وسواس، استرس و اضطراب در زندگی است. 
بنابراین باید سبک زندگی خود را طوری تغییر دهید که به کنترل استرس و نگرانی شما کمک کند. برای این منظور روش‌های زیر برای درمان وسواس مفید خواهد بود. لازم به ذکر است که استفاده از روش های زیر تا حد زیادی به شما برای بهبود وسواس و استرس کمک می کند 

*	روش اول: فعالیت‌های منظم بدنی داشته باشید و ورزش کنید. بهتر است تمرین‌ها را در چند نوبت در طول روز مثلا در سه تایم ۱۰ دقیقه ای و با تمرکز انجام دهید.
*	روش دوم: ارتباط خود را با اطرافیان حفظ کنید. تنهایی و انزوا علائم وسواس عملی-فکری را تشدید می‌کند. ارتباط با اطرافیان، دوستان و خانواده و بیان نگرانی‌ها می‌تواند در کاهش این استرس ها موثر باشد.
*	یکی از راه‌های موثر برای درمان اختلال وسواس، مقابله و مقاومت در برابر رفتارهای مکرر و وسواس گونه است در هر یک از موارد زیر می توانید راه‌حل‌های خود را داشته باشید.
*	با ترس هایتان روبرو شوید. به جای فرار کردن از ترس، خود را در شرایط اضطراب آور قرار دهید و سعی کنید الگوی رفتاری خود را در زمان مواجهه با این شرایط تغییر دهید. اگر این امکان برای شما وجود ندارد، سعی کنید مدت زمان انجام رفتارهای وسواسی را به تدریج کم کنید. هنگام مقابله با وسواس، به تدریج احساس کنترل اوضاع در شما به وجود می آید.
*	ذهن خود را با چیزهای دیگری مشغول کنید. زمانی که رفتارها و افکار های وسواس گونه در شما بروز می‌کند توجه تان را به چیز دیگری جلب کنید. کارهایی را که به آنها علاقه دارید، انجام دهید. مثلا ورزش کنید، کتاب بخوانید، بازی کامپیوتری انجام بدید، با دوستان خود صحبت کنید، کلیپ های مورد علاقه تان را نگاه کنید و خلاصه هر کاری که در پرت کردن حواستان موثر است را انجام دهید و افکار و رفتار وسواسی را به تأخیر بیندازید. معمولاً پس از اینکه توانستید تمایلات را به تأخیر بیندازید، متوجه می‌شوید که شدت آن ها کمتر شده و تمایل تان به وسواس کاهش یافته است. هر چه بیشتر تمایلات به وسواس را منتظر بگذارید،  آن ها کمتر به سراغ شما می آیند.
 
*	افکار وسواس گونه را به چالش بکشید
اختلال وسواس فکری-عملی همانند قفلی در مغزتان، روی مسئله خاصی قفل شده و موجب ایجاد اضطراب و استرس می شود. از راه های زیر برای باز کردن این قفل مغزی استفاده کنید.
افکار و رفتارهای وسواسی خود را ثبت و یادداشت کنید. زمانی که این تمایلات فکری و رفتاری به سراغتان آمد، آن را یادداشت و ثبت کنید. تا زمانی که افکار و تمایلات وسواسی تان ادامه دارد، شما هم به ثبت آن ادامه دهید. حتی اگر تکراری باشند آن ها را ثبت کنید. این کار به شما در درک رفتارتان کمک می‌کند، همچنین قدرت این احساس را در شما تضعیف می‌کند، زیرا شما شناخت بیشتری از رفتار وسواس گونه خود پیدا کرده اید.
*	برای بروز تمایلات اختلال وسواس فکری عملی زمان مشخصی اختصاص دهید. 
هر روز زمان مشخصی مثلاً دو یا سه تایم ۱۰ دقیقه ای تعیین کنید و در این زمان‌ها به وسواس‌های خود اجازه بروز بدهید. زمان هایی را تعیین کنید که نزدیک زمان خواب تان نباشد و خوابتان را مضطرب و آشفته نکند. در طول این زمان های معین شده اجازه دهید افکار وسواس گونه در ذهنتان جریان یابد. آن‌ها را سرکوب یا اصلاح نکنید، فقط مشاهده گر آنها باشید و پس از آن وظایف روزمره خود را پیگیری کنید.
*	در مورد رفتارهای وسواسی خود یک نوار صوتی تهیه کنید. روی فکری که بیش از همه با آن درگیر هستید، تمرکز کنید، سپس با هر وسیله ثبت صدایی گفته‌های خود را درباره آن موضوع ضبط کنید. جمله‌ها را آنگونه که به ذهنتان می رسد بیان کنید، سپس مدتی را برای گوش دادن به صدای خودتان در طول روز اختصاص دهید تا بتوانید با وسواس فکری کنار بیاید.
*	پیش‌بینی تمایلات اختلال وسواس فکری – عملی
اگر شما بتوانید تمایلات وسواس گونه‌تان را پیش‌بینی کنید، می‌توانید راحت‌تر با آن مقابله کنید. مثلا در حین قفل کردن در ماشین، همان اول کار را با دقت زیادی انجام دهید و خیال خودتان رو از بابت بسته بودن در راحت کنید. در حین انجام کارهایی که وسواس دارید، یک جمله تأیید مانند من "دارم میبینم که درو قفل می کنم" به شما کمک زیادی می‌کند یا در هنگام بروز تمایل به چک کردن دوباره در خوردرو به خود بگویید، که " خیالت راحت این فقط یه فکر وسواس گونه است".
"""
const val ezterabPish="""از آنجا که اضطراب در سطوح متوسط رو به بالا موجب اختلال عملکرد در افراد می شود و اغلب با کاهش کارایی و مشکل در روابط بین فردی می شود . لذا نقش راهکارهای کاهش اضطراب از اهمیت خاصی برخودار است. برخی از این راهکارهای به سادگی می توان انجام داد مانند ورزش کردن ، بهداشت خواب ،کم کردن مصرف کافئین، برنامه ریزی برای کارها و تکنیک های ریلکسیشن است که به تفصیل در بخش آموزش به آن پرداخته می شود."""

    const val afsordegiPish="""افسردگی یکی از ناتوان کننده ترین اسیب های روانی باشد. که با یک حس نارضایتی کلی و از دست دادن انگیزه و لذت همراه است. ذهن افسرده تمایل دارد که همچیز را از فیلتر منفی ببیند . استفاده از راهکارهای کاهش افسردگی در ابتدای شروع این احساسات حائز اهمیت است . برخی از این راهکارها به شرح زیر می باشد: بی توجهی به  اخبار منفی ،برنامه ریزی برای گذراندن وقت بیشتر با خانواده و دوستان ، استفاده از تکنیک توقف فکر جهت دستیابی بیشتر این راهکارها می توانید به بخش آموزش مراجعه کنید ."""
const val vasvasPish = """وسواس مانند یک ایده یک تصویر یا یک حرکت مکرر که با احساس علاقه و اجبار همراه است تعریف می شود و باعث اختلال در انجام امور روز مره ما میشود همچنین بر روی  روابط بین ما نیز تاثیر گذاشته و باعث تخریب آن می شود .برخی از راهکارهای کاهش وسواس به شرح زیر است: غلبه بر ترس ها ، سرگرم شدن با فعالیت های مفید و آزاد نگه داشتن ذهن، تعیین زمان مشخص برای فکر کردن و یا انجام کار وسواسی مثلا در روز یک بار و دریک ساعت خاص و با یک مدت زمان مشخص . برای استفاده بیشتر از این راهکارها به بخش آموزش مراجعه کنید."""





    const val malamatKhish ="""	ملامت خود: در این راهبرد شناختی، فرد به دلیل داشتن افکار خاصی خود را مسبب رویداد بد دانسته و خود را سرزنش می کند. نتایج پژوهش‌ها نشان می دهد که استفاده از این راهبرد با افسردگی و دیگر اختلالات روانی رابطه دارد"""
    const val malamatDigran ="""	 ملامت دیگران: ملامت دیگران به راهبرد شناختی اشاره دارد که بر اساس آن فرد به خاطر اتفاق افتادن رویداد بد، دیگران را ملامت و سرزنش می کند. مطالعاتی که روی افراد با تجربه‌های بد انجام شده، نشان می دهد که ملامت کردن دیگران با بهزیستی هیجانی ضعیف رابطه دارد """
    const val fajeesazi ="""	فاجعه سازی: به افکاری اشاره دارد که به وضوح بر وحشتناک و آسیب زا بودن یک رویداد تأکید دارند"""
    const val noshkhargari ="""	نشخوارگری یا تمرکز روی افکار: نشخوارگری یا تمرکز روی افکار به اندیشیدن درباره احساسات یا افکار مربوط به رویداد منفی، اشاره دارد. نتایج مطالعه ای نشان داد که بین سبک مقابله ای نشخوارگرانه و سطوح بالای افسردگی رابطه وجود دارد"""
    const val paziresh ="""	پذیرش: این راهبرد به افکاری اشاره دارد که طی آنها فرد رویداد تجربه شده را پذیرفته و سعی می کند با آنچه اتفاق افتاده کنار بیاید. مطالعه ای نشان داد که پذیرش به عنوان یک راهبرد مقابله ای با خوش بینی و عزت نفس رابطه مثبت، و با اضطراب رابطه منفی دارد."""
    const val tamarkozMojadadBarBarnameRizi ="""	تمرکز مجدد بر برنامه ریزی: این راهبرد به افکار فرد درباره گام‌هایی که برای مواجهه با رویداد منفی باید برداشته شود، اشاره دارد. مطالعه کارور و همکاران نشان داد که استفاده از راهبرد برنامه ریزی با خوش بینی و عزت نفس رابطه مثبت و با اضطراب رابطه منفی دارد."""
    const val tamarkozMojadadMosbat ="""	تمرکز مجدد مثبت: این راهبرد به افکاری اشاره دارد که طی آن فرد به جای فکر کردن درباره رویداد منفی کنونی به موضوعات شاد و لذتبخش فکر می کند. به عبارت دیگر در این راهبرد فرد به جای رویداد منفی، ذهن خود را درگیر موضوعات مثبت کرده و کمتر به موضوعات منفی می پردازد."""
    const val arzyabiMojadadMosbat ="""	ارزیابی مجدد مثبت: این راهبرد به افکاری اشاره دارد که طی آن فرد می کوشد تا از رویداد منفی کنونی، معنایی مثبت در جهت رشد خود برداشت کند. مطالعه ای نشان داد که ارزیابی مجدد مثبت رابطه مثبتی با خوش بینی و عزت نفس دارد و با اضطراب رابطه منفی دارد."""
    const val didgahGiri ="""	دیدگاه پذیری: این راهبرد به افکاری اشاره دارد که طی آنها فرد به این می اندیشد که این رویداد در مقایسه با رویدادهای دیگر خیلی هم بد و ناگوار نیست."""

    const val guideMasaleEjtemai= """در زندگی ما انسان‌ها واقعیت‌های تلخ وشیرینی وجود دارد که چه بخواهیم وچه نخواهیم مجبور به مواجهه با آن هستیم. امّا این مواجهه‌ها همیشه درست و منطقی نبوده است. چگونگی مواجهه با مسائل و واقعیت‌های زندگی مستلزم داشتن مهارتی تحت عنوان مهارت حلّ مسئله اجتماعی است 
افراد میتوانند با افزایش مهارت‌های شناختی، فراشناختی و اجتماعی، توانایی حلّ مسئله خود را بهبود ‌بخشند؛  حلّ مسئله اجتماعی به فرآیند شناختی – رفتاری فرد اطلاق می شود  و به وسیله آن فرد می خواهد راهبردهای مؤثّر و سازگارانه از نوع مقابله‌ای را برای مشکلات روزمره تعیین،کشف یا ابداع کند."""
const val guideNazm = """هيجان نقش مهمي در جنبه‌هاي مختلف زندگي نظير سازگاري با تغييرات زندگي و رويدادهاي تنيدگيزا ایفا می‌کند.بنابراين تنظیم هيجان، يک اصل اساسي در شروع، ارزيابي و سازماندهي رفتار سازگارانه و همچنين جلوگيري از هيجان‌هاي منفي و رفتارهاي ناسازگارانه محسوب مي‌شود.در حقیقت واژه تنظیم هيجان مشتمل بر راهبردهايي است که باعث کاهش، حفظ و يا افزايش يک هيجان مي‌شوند و به فرايندهايي اشاره دارد که بر هيجان‌هاي کنوني فرد و چگونگي تجربه و ابراز آن‌ها اثر مي‌گذارد."""
}