package co.health.test.corona.screen.main.home.learn.dummy

import org.json.JSONArray
import org.json.JSONObject
import java.util.ArrayList
import java.util.HashMap

/**
 * Helper class for providing sample content for user interfaces created by
 * Android template wizards.
 *
 * TODO: Replace all uses of this class before publishing your app.
 */
object DummyContent {

    /**
     * An array of sample (dummy) items.
     */
    val ITEMS: MutableList<DummyItem> = ArrayList()

    /**
     * A map of sample (dummy) items, by ID.
     */
    val ITEM_MAP: MutableMap<String, DummyItem> = HashMap()

    val jsonArray = JSONArray(khabarString)
    private val COUNT = 15

    init {
        // Add some sample items.
        for (i in 1..COUNT) {
            addItem(createDummyItem(i))
        }
    }

    private fun addItem(item: DummyItem) {
        ITEMS.add(item)
        ITEM_MAP[item.id] = item
    }

    private fun createDummyItem(position: Int): DummyItem {
        val obj = jsonArray.getJSONObject(position)
        val src = obj.getJSONObject("figure").getJSONObject("a").getJSONObject("img").getString("@src")
        val title = obj.getJSONObject("figure").getJSONObject("a").getJSONObject("img").getString("@alt")
        val date = obj.getJSONObject("div").getJSONObject("time").getJSONObject("a").getString("@title")
        return DummyItem(position.toString(), title, date,src)
    }

    private fun makeDetails(position: Int): String {
        val builder = StringBuilder()
        builder.append("Details about Item: ").append(position)
        for (i in 0 until position) {
            builder.append("\nMore details information here.")
        }
        return builder.toString()
    }

    /**
     * A dummy item representing a piece of content.
     */
    data class DummyItem(val id: String, val content: String, val date: String,val srcImage:String) {
        override fun toString(): String = content
    }
}

const val khabarString="""[
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99020402734/آیا-حساسیت-های-فصلی-بر-روی-کرونا-تاثیر-دارد",
            "img": {
              "@src": "https://media.isna.ir/content/allergies-field-140523.jpg/2",
              "@alt": "آیا حساسیت‌های فصلی بر روی کرونا تاثیر دارد؟"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99020402734/آیا-حساسیت-های-فصلی-بر-روی-کرونا-تاثیر-دارد",
              "@target": "_blank",
              "em": [
                "حساسیت‌های",
                "کرونا"
              ],
              "#text": [
                "آیا",
                "فصلی بر روی",
                "تاثیر دارد؟"
              ]
            }
          },
          "p": [
            "رییس انجمن ایمونولوژی و آلرژی ایران با بیان اینکه حدود ۲۰ درصد از افراد در جوامع صنعتی می‌توانند از بستر و واکنش‌های آلرژیک رنج ببرند، گفت: در شرایط کنونی ممکن است رینیت آلرژیک بتواند به نوعی زمینه‌ساز، مستعدکننده و اثرگذار بر روی کووید۱۹ باشد.",
            {
              "em": [
                "کرونا",
                "حساسیت",
                "تفاوت‌های"
              ],
              "#text": [
                "...به گزارش ایسنا، دکتر محمد وجگانی در خصوص شباهت بین علائم",
                "و",
                "فصلی، گفت: عمده‌ترین شباهت این است که هر دو...، دستگاه تنفسی فوقانی را درگیر می‌کنند؛ یعنی ما علائم و نشانه‌ها را در بینی، حلق و حنجره داریم. البته",
                "بسیاری نیز بین..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99020402734/آیا-حساسیت-های-فصلی-بر-روی-کرونا-تاثیر-دارد",
              "@target": "_blank",
              "@title": "پنجشنبه ۴ اردیبهشت ۱۳۹۹ - ۰۹:۵۹",
              "span": "۴",
              "#text": "اردیبهشت ۹۹ - ۹:۵۹"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99020201616/جدیدترین-یافته-های-کمی-محققان-درباره-اثرات-کرونا-بر-بویایی-کاهش",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/21/2/61619398.jpg",
              "@alt": "جدیدترین یافته‌های کمّی محققان درباره اثرات کرونا بر بویایی/کاهش شامه جدی گرفته شود"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99020201616/جدیدترین-یافته-های-کمی-محققان-درباره-اثرات-کرونا-بر-بویایی-کاهش",
              "@target": "_blank",
              "#text": "در گفت‌وگو با ایسنا اعلام شد"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99020201616/جدیدترین-یافته-های-کمی-محققان-درباره-اثرات-کرونا-بر-بویایی-کاهش",
              "@target": "_blank",
              "em": "کرونا",
              "#text": [
                "جدیدترین یافته‌های کمّی محققان درباره اثرات",
                "بر بویایی/کاهش شامه جدی گرفته شود"
              ]
            }
          },
          "p": [
            "مطالعه مشترک و بین‌المللی گروهی از محققان پژوهشگاه دانش‌های بنیادی و بیمارستان مسیح دانشوری نشان می‌دهد که از دست رفتن یا کاهش حس بویایی یکی از علایم همراه در بیماران مبتلا به بیماری کووید-۱۹ است؛ از این رو پیشنهاد می‌شود افرادی که دچار کاهش حس بویایی شده‌اند، با توجه به احتمال ابتلا به بیماری، اقدام به قرنطینه و ایزوله خود کنند، ضمن آنکه این محققان تاکید می‌کنند که عدم اختلال در بویایی، به معنای عدم ابتلا به بیماری کووید-۱۹ نیست.",
            {
              "em": [
                "کرونا",
                "تفاوت",
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "... از دسته‌های مبتلایان به ویروس",
                "از لحاظ سطح کاهش حس بویایی",
                "معنی‌داری وجود نداشت و همه آنها به طور یکسان دچار کاهش... در گفت‌وگو با ایسنا، در این باره گفت: پس از شیوع ویروس",
                "، مشاهده کردیم تعداد زیادی از افرادی که به ویروس",
                "و یا کووید-۱۹..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99020201616/جدیدترین-یافته-های-کمی-محققان-درباره-اثرات-کرونا-بر-بویایی-کاهش",
              "@target": "_blank",
              "@title": "چهارشنبه ۳ اردیبهشت ۱۳۹۹ - ۰۵:۲۵",
              "span": "۳",
              "#text": "اردیبهشت ۹۹ - ۵:۲۵"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99020200874/چرا-آمار-کرونا-در-استان-بوشهر-ناسازگاری-دارد",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/bushehr/2020/04/12/2/61613199.jpg",
              "@alt": "چرا آمار کرونا در استان بوشهر ناسازگاری دارد؟"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99020200874/چرا-آمار-کرونا-در-استان-بوشهر-ناسازگاری-دارد",
              "@target": "_blank",
              "em": "کرونا",
              "#text": [
                "چرا آمار",
                "در استان بوشهر ناسازگاری دارد؟"
              ]
            }
          },
          "p": [
            {
              "em": "کرونا",
              "#text": [
                "ویروس",
                "نامی که نخستین بار از ووهان در دنیا طنین انداز شد و روزهای زیادی است که ناقوس مرگ را به صدا درآورده و جان های زیادی را می گیرد!"
              ]
            },
            {
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "... گذشته -سه شنبه / ۱ اردیبهشت ۱۳۹۹- سخنگوی وزارت بهداشت از شناسایی ۱۲۹۴ بیمار جدید",
                "بر اساس معیارهای قطعی تشخیصی در کشور... خبر داد. این در حالی است که به گواه آمار وزارت بهداشت تا امروز ۵۲۰۹ نفر از بیماران مبتلا به",
                "، جان باخته اند و ۵۹ هزار..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99020200874/چرا-آمار-کرونا-در-استان-بوشهر-ناسازگاری-دارد",
              "@target": "_blank",
              "@title": "سه‌شنبه ۲ اردیبهشت ۱۳۹۹ - ۰۶:۲۷",
              "span": "۲",
              "#text": "اردیبهشت ۹۹ - ۶:۲۷"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99020100687/خارش-شاخص-ترین-تفاوت-بین-آلرژی-تنفسی-و-کرونا",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/khorasan/2020/04/20/2/61618515.jpg",
              "@alt": "خارش؛ شاخص‌ترین تفاوت بین آلرژی تنفسی و کرونا "
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99020100687/خارش-شاخص-ترین-تفاوت-بین-آلرژی-تنفسی-و-کرونا",
              "@target": "_blank",
              "#text": "متخصص آلرژی مطرح کرد؛"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99020100687/خارش-شاخص-ترین-تفاوت-بین-آلرژی-تنفسی-و-کرونا",
              "@target": "_blank",
              "em": [
                "تفاوت",
                "کرونا"
              ],
              "#text": [
                "خارش؛ شاخص‌ترین",
                "بین آلرژی تنفسی و"
              ]
            }
          },
          "p": [
            {
              "em": [
                "تفاوت",
                "کرونا"
              ],
              "#text": [
                "یک متخصص ایمنی‌شناسی بالینی ایمونولوژیک گفت: خارش یکی از اصلی‌ترین و شاخص‌ترین",
                "میان بیماری آلرژی تنفسی و بیماری",
                "است."
              ]
            },
            {
              "em": [
                "",
                "تفاوت",
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "...رضا فریدحسینی، در",
                "گفت‌و با ایسنا در خصوص",
                "بین آلرژی تنفسی و بیماری",
                "، اظهار کرد: همزمانی شروع و افزایش شیوع... آلرژی فصلی با بیماری",
                "، نگرانی‌های بسیار زیادی در ایران و سایرکشورها برای افراد مبتلا به آلرژی فصلی ایجاد نموده..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99020100687/خارش-شاخص-ترین-تفاوت-بین-آلرژی-تنفسی-و-کرونا",
              "@target": "_blank",
              "@title": "دوشنبه ۱ اردیبهشت ۱۳۹۹ - ۱۶:۱۷",
              "span": "۱",
              "#text": "اردیبهشت ۹۹ - ۱۶:۱۷"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99020100086/لزوم-ترویج-گفتمان-احترام-به-حق-سلامت",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/khouzestan/2020/04/05/2/61608270.jpg",
              "@alt": "لزوم ترویج گفتمان &quot;احترام به حق سلامت&quot;"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99020100086/لزوم-ترویج-گفتمان-احترام-به-حق-سلامت",
              "@target": "_blank",
              "#text": "عضو هیات علمی جامعه‌شناسی دانشگاه چمران اهواز تاکید کرد:"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99020100086/لزوم-ترویج-گفتمان-احترام-به-حق-سلامت",
              "@target": "_blank",
              "#text": "لزوم ترویج گفتمان \"احترام به حق سلامت\""
            }
          },
          "p": [
            "عضو هیات علمی جامعه‌شناسی دانشگاه شهید چمران اهواز با تاکید بر لزوم ترویج گفتمان احترام به حق سلامت، گفت: ابتدا باید سلامت به عنوان یک حق مطرح شود و وظیفه ما این است که خود مراقبت کنیم و به سلامتی دیگران نیز اهمیت دهیم.",
            {
              "em": [
                "حساسیت",
                "کرونا",
                "حساسیت",
                "کرونا"
              ],
              "#text": [
                "...: در جامعه‌شناسی مفهومی تحت عنوان \"",
                "اخلاقی\" داریم. ما می‌توانیم از طریق رسانه‌ها که انصافا در بحران",
                "خوب عمل کردند، از طریق... شبکه‌های اجتماعی موثق آگاه‌سازی کنیم و دانش افراد جامعه و یا به عبارتی \"",
                "اخلاقی\" را نسبت به",
                "افزایش دهیم. ترویج..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99020100086/لزوم-ترویج-گفتمان-احترام-به-حق-سلامت",
              "@target": "_blank",
              "@title": "دوشنبه ۱ اردیبهشت ۱۳۹۹ - ۰۹:۱۲",
              "span": "۱",
              "#text": "اردیبهشت ۹۹ - ۹:۱۲"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99013118441/برخی-سوء-استفاده-های-اقتصادی-از-کرونا-کووید۱۹-همچنان-بدون-درمان",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/19/2/61617469.jpg",
              "@alt": "برخی سوء استفاده‌های اقتصادی از کرونا / کووید۱۹ همچنان بدون درمان و واکسن قطعی"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99013118441/برخی-سوء-استفاده-های-اقتصادی-از-کرونا-کووید۱۹-همچنان-بدون-درمان",
              "@target": "_blank",
              "#text": "رییس سازمان غذا و دارو اعلام کرد"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99013118441/برخی-سوء-استفاده-های-اقتصادی-از-کرونا-کووید۱۹-همچنان-بدون-درمان",
              "@target": "_blank",
              "em": "کرونا",
              "#text": [
                "برخی سوء استفاده‌های اقتصادی از",
                "/ کووید۱۹ همچنان بدون درمان و واکسن قطعی"
              ]
            }
          },
          "p": [
            "رییس سازمان غذا و دارو با تاکید براینکه هنوز هیچ دارو و واکسن تایید شده‌ای در دنیا برای درمان کووید-۱۹ معرفی نشده، گفت: همه مواردی که در فضای مجازی مطرح می‌شود، بحث اقتصادی و انتفاع نامناسب و غیراخلاقی است که واقعیت هم ندارند؛ این داروها هنوز مورد تایید نیستند، بلکه پیشنهادات زیادی است که در حال بررسی است.",
            {
              "em": [
                "حساسیت",
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "... و",
                "انجام دهیم و همین اتفاق هم افتاده است و همکارانی را که اقلام مرتبط با",
                "را تامین می‌کنند از همکارانی که در زمینه... عربستان برای ورود کیت‌های تشخیصی",
                "به ایران، ‌ گفت: بحث راهزنی محموله‌ها و اقلام مورد نیاز بیماران کرونایی در دنیا حتی..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99013118441/برخی-سوء-استفاده-های-اقتصادی-از-کرونا-کووید۱۹-همچنان-بدون-درمان",
              "@target": "_blank",
              "@title": "یکشنبه ۳۱ فروردین ۱۳۹۹ - ۱۲:۱۳",
              "span": "۳۱",
              "#text": "فروردین ۹۹ - ۱۲:۱۳"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99013017600/وام-۵۰-میلیون-دلاری-بانک-جهانی-برای-مقابله-با-کرونا-افزایش-تا",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/18/2/61616723.jpg",
              "@alt": "وام ۵۰ میلیون دلاری بانک جهانی برای مقابله با کرونا/افزایش تا ۵۰ درصدی حقوق کارکنان سلامت"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99013017600/وام-۵۰-میلیون-دلاری-بانک-جهانی-برای-مقابله-با-کرونا-افزایش-تا",
              "@target": "_blank",
              "#text": "معاون وزیر بهداشت اعلام کرد"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99013017600/وام-۵۰-میلیون-دلاری-بانک-جهانی-برای-مقابله-با-کرونا-افزایش-تا",
              "@target": "_blank",
              "em": "کرونا",
              "#text": [
                "وام ۵۰ میلیون دلاری بانک جهانی برای مقابله با",
                "/افزایش تا ۵۰ درصدی حقوق کارکنان سلامت"
              ]
            }
          },
          "p": [
            {
              "em": "کرونا",
              "#text": [
                "معاون توسعه مدیریت و منابع وزارت بهداشت ضمن تشریح اعتبارات دریافت شده برای مقابله با",
                "از منابع مختلف، گفت: از سال ۲۰۰۵ تا کنون، برای اولین بار وامی را از بانک جهانی به میزان ۵۰ میلیون دلار"
              ]
            },
            {
              "em": [
                "",
                "کرونا"
              ],
              "#text": [
                "... است. البته اعتقاد ما بر این است که همکاران پرستارمان زودتر بتوانند به",
                "حق‌و حقوق‌شان برسند.\r\n\r\nتقوی‌نژاد افزود: در عین حال اکنون... مبارزه با بیماری",
                "، گفت: همانطور که می‌دانید تعدادی از همکاران ما جبهه‌های جنگ را تجربه کردند و امروز فصل دیگری از مجاهدت..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99013017600/وام-۵۰-میلیون-دلاری-بانک-جهانی-برای-مقابله-با-کرونا-افزایش-تا",
              "@target": "_blank",
              "@title": "شنبه ۳۰ فروردین ۱۳۹۹ - ۱۲:۱۲",
              "span": "۳۰",
              "#text": "فروردین ۹۹ - ۱۲:۱۲"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99013017378/تفاوت-های-کرونا-و-حساسیت-فصلی",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/07/2/61609540.jpg",
              "@alt": "تفاوت‌های کرونا و حساسیت فصلی"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99013017378/تفاوت-های-کرونا-و-حساسیت-فصلی",
              "@target": "_blank",
              "em": [
                "تفاوت‌های",
                "کرونا",
                "حساسیت"
              ],
              "#text": [
                "و",
                "فصلی"
              ]
            }
          },
          "p": [
            {
              "em": [
                "تفاوت‌های",
                "حساسیت",
                "کرونا"
              ],
              "#text": [
                "معاون بهداشت دانشگاه علوم پزشکی تبریز، برخی",
                "فصلی و",
                "را تشریح کرد."
              ]
            },
            {
              "em": [
                "حساسیت",
                "تفاوت‌های",
                "حساسیت‌های",
                "کرونا",
                "کرونا",
                "حساسیت"
              ],
              "#text": [
                "... بهداشتی و ضد عفونی کننده نیز می‌تواند از دلایل دیگر ابتلای فرد به",
                "باشد.\r\n\r\nوی با اشاره به برخی",
                "... فصلی و",
                "، گفت: برخی علایم، اختصاصی",
                "هستند، مثلا مواردی مانند درد عضلانی و دردهای عمومی بدن را هرگز در",
                "فصلی..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99013017378/تفاوت-های-کرونا-و-حساسیت-فصلی",
              "@target": "_blank",
              "@title": "شنبه ۳۰ فروردین ۱۳۹۹ - ۰۹:۳۱",
              "span": "۳۰",
              "#text": "فروردین ۹۹ - ۹:۳۱"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012816646/اگر-کودک-یا-زنی-مورد-خشونت-قرار-گیرد-قانون-چه-حمایتی-از-او-می-کند",
            "img": {
              "@src": "https://cdn.isna.ir/d/2019/12/14/2/61511044.jpg",
              "@alt": "اگر کودک یا زنی مورد خشونت قرار گیرد قانون چه حمایتی از او می‌کند؟\r\n"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99012816646/اگر-کودک-یا-زنی-مورد-خشونت-قرار-گیرد-قانون-چه-حمایتی-از-او-می-کند",
              "@target": "_blank",
              "#text": "اگر کودک یا زنی مورد خشونت قرار گیرد قانون چه حمایتی از او می‌کند؟"
            }
          },
          "p": [
            {
              "em": "کرونا",
              "#text": [
                "این روزها که ویروس",
                "اذهان جهانی را به خود معطوف کرده و مردم اغلب برای کاهش شیوع این ویروس در قرنطینه خانگی به سر می‌برند، برخی کارشناسان و مسئولان حوزه خانواده نسبت به مشکلات خانوادگی ناشی"
              ]
            },
            {
              "em": [
                "تفاوت",
                "کرونا"
              ],
              "#text": [
                "... خانواده با یکدیگر می‌تواند ناشی از",
                "دیدگاه‌ها، سلایق، عملکردها و رفتارها  باشد که تا حدودی اجتناب‌ناپذیر است، به خصوص... از فرصت آرامش اعضای خانواده در کنار هم شد و این نوع آسیب‌ها نیز به مانند ویروس",
                "فرصتی برای بروز و ظهور و رشد مخرب در داخل..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012816646/اگر-کودک-یا-زنی-مورد-خشونت-قرار-گیرد-قانون-چه-حمایتی-از-او-می-کند",
              "@target": "_blank",
              "@title": "جمعه ۲۹ فروردین ۱۳۹۹ - ۰۶:۰۰",
              "span": "۲۹",
              "#text": "فروردین ۹۹ - ۶:۰"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012816580/فاصله-گرفتن-آستارا-از-فاصله-گذاری-اجتماعی",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/gilan/2020/04/16/2/61615441.jpg",
              "@alt": "فاصله گرفتن آستارا از فاصله گذاری اجتماعی!"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99012816580/فاصله-گرفتن-آستارا-از-فاصله-گذاری-اجتماعی",
              "@target": "_blank",
              "#text": "فاصله گرفتن آستارا از فاصله گذاری اجتماعی!"
            }
          },
          "p": [
            "پس از قرنطینه ۲۳ روزه بندر مرزی آستارا که با نحوه اجرای صحیح فاصله گذاری اجتماعی توسط مسئولان و حمایت های آحاد مختلف مردم و اصناف، نام شهرستان در سطح کشور زبانزد شد، آنچه که پس از ۲۳ فروردین شاهد آن هستیم، بی تفاوتی مطلق اکثر شهروندان به اجرای طرح مذکور است.",
            {
              "em": [
                "کرونا",
                "حساسیت"
              ],
              "#text": [
                "...گیلان ، یکی از شهرهای درگیر با ویروس",
                "پس از استان قم بود و در شهرستان آستارا در غرب این استان، علاوه بر مبتلا شدن... ها و",
                "های افراد کاسته شد و هم اکنون درب بسیاری از واحدهای صنفی به خصوص رستوران ها، ساندویچی ها و حتی طباخی ها و کبابی..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012816580/فاصله-گرفتن-آستارا-از-فاصله-گذاری-اجتماعی",
              "@target": "_blank",
              "@title": "پنجشنبه ۲۸ فروردین ۱۳۹۹ - ۱۱:۴۲",
              "span": "۲۸",
              "#text": "فروردین ۹۹ - ۱۱:۴۲"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012715638/تغییر-رفتار-مردم-نسبت-به-اپیدمی-کرونا-نگران-کننده-است-کرونا",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/14/2/61614566.jpg",
              "@alt": "تغییر رفتار مردم نسبت به اپیدمی کرونا، نگران کننده است/«کرونا» هنوز کنترل نشده است"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99012715638/تغییر-رفتار-مردم-نسبت-به-اپیدمی-کرونا-نگران-کننده-است-کرونا",
              "@target": "_blank",
              "#text": "یک استاد اپیدمیولوژی هشدار داد"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99012715638/تغییر-رفتار-مردم-نسبت-به-اپیدمی-کرونا-نگران-کننده-است-کرونا",
              "@target": "_blank",
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "تغییر رفتار مردم نسبت به اپیدمی",
                "، نگران کننده است/«",
                "» هنوز کنترل نشده است"
              ]
            }
          },
          "p": [
            {
              "em": "حساسیت",
              "#text": [
                "استاد اپیدمیولوژیست دانشگاه علوم پزشکی کرمان با اشاره به کاهش",
                "مردم نسبت به این بیماری طی چند روز اخیر گفت: در مقابله با کووید ۱۹، رفتار مردم در خط اول و اقدامات مراکز درمانی در خط آخر قرار"
              ]
            },
            {
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "... که مرتبط با رفتار انسان‌ها می باشد، بسیار دشوار است و چون روند پیشروی ویروس",
                "به رفتار مردم بستگی دارد، بنابراین پیش بینی...، تنگی نفس یا کوفتگی هستند، حتما باید خودشان را ایزوله کنند تا بتوان زنجیر انتقال ویروس را بشکنند. \r\nانتقال ویروس",
                "مانند..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012715638/تغییر-رفتار-مردم-نسبت-به-اپیدمی-کرونا-نگران-کننده-است-کرونا",
              "@target": "_blank",
              "@title": "چهارشنبه ۲۷ فروردین ۱۳۹۹ - ۰۹:۱۴",
              "span": "۲۷",
              "#text": "فروردین ۹۹ - ۹:۱۴"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012615298/صنایع-غذایی-در-جدال-با-کرونا",
            "img": {
              "@src": "https://cdn.isna.ir/d/2016/06/10/2/57301554.jpg",
              "@alt": "صنایع غذایی در جدال با کرونا"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99012615298/صنایع-غذایی-در-جدال-با-کرونا",
              "@target": "_blank",
              "em": "کرونا",
              "#text": "صنایع غذایی در جدال با"
            }
          },
          "p": [
            {
              "em": "کرونا",
              "#text": [
                "در زمان تولید از گزند ویروس",
                "در امان هستند؟"
              ]
            },
            {
              "em": [
                "تفاوت",
                "کرونا",
                "تفاوت",
                "کرونا"
              ],
              "#text": [
                "... تولید تا زمانی که به دست مصرف کننده می رسد با دقت انجام می شود، گفت:",
                "امروز با دوران پیش از",
                "در این است که در حال... ماتریس درباره",
                "شرایط تولید و رعایت مسائل بهداشتی قبل و بعد از شیوع ویروس",
                "به ایسنا، گفت: در حال حاضر نه تنها..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012615298/صنایع-غذایی-در-جدال-با-کرونا",
              "@target": "_blank",
              "@title": "سه‌شنبه ۲۶ فروردین ۱۳۹۹ - ۱۴:۲۲",
              "span": "۲۶",
              "#text": "فروردین ۹۹ - ۱۴:۲۲"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012614876/زخم-های-عمیق-صنعت-گردشگری-التیام-یابد",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/03/29/2/61603875.jpg",
              "@alt": "زخم‌های عمیق صنعت گردشگری التیام یابد "
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99012614876/زخم-های-عمیق-صنعت-گردشگری-التیام-یابد",
              "@target": "_blank",
              "#text": "زخم‌های عمیق صنعت گردشگری التیام یابد"
            }
          },
          "p": [
            "یک فعال گردشگری می گوید شدت و حدت شرایط اضطراری حاضر قابل انکار نیست و تاثیر گسترده آن بر پیکره صنعت گردشگری و هتلداری در سطح جهانی ملموس و محسوس است بنابراین لازم است که زخم‌های عمیق صنعت گردشگری التیام یابد.",
            {
              "em": [
                "کرونا",
                "حساسیت‌های"
              ],
              "#text": [
                "...فرخ میرشاهزاده در گفت‌وگو با ایسنا در خصوص فعالیت جامعه هتلداران در ایام نوروز با وجود خطر ویروس",
                "عنوان کرد: صنعت... به شمار می‌آید، بدیهی است که این کسب و کارِ خدماتی و چند وجهی، به واسطه ویژگی‌های پیچیده و",
                "بالای خود، به شدت تحت..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012614876/زخم-های-عمیق-صنعت-گردشگری-التیام-یابد",
              "@target": "_blank",
              "@title": "سه‌شنبه ۲۶ فروردین ۱۳۹۹ - ۰۹:۴۸",
              "span": "۲۶",
              "#text": "فروردین ۹۹ - ۹:۴۸"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012614823/بگومگوهای-کرونایی",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/hamedan/2020/04/14/2/61614012.jpg",
              "@alt": "بگومگوهای کرونایی"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99012614823/بگومگوهای-کرونایی",
              "@target": "_blank",
              "#text": "بگومگوهای کرونایی"
            }
          },
          "p": [
            {
              "em": [
                "تفاوت",
                "کرونا"
              ],
              "#text": [
                "این روزها حال و هوای شهرها و خانه های مردم",
                "بزرگی به نسبت ماه های گذشته دارد و سبک زندگی مردم تحت تاثیر شیوع ویروس کووید ۱۹ یا همان",
                "قرار گرفته است."
              ]
            },
            {
              "em": [
                "کرونا",
                "حساسیت",
                "کرونا"
              ],
              "#text": [
                "...",
                "و افزایش",
                "های موجود در جامعه مشاورین سامانه ۱۴۸۰ آموزش ویژه دیده و از ابتدای فروردین ماه از ساعت ۸ صبح تا ۱۲ شب... خود را در نهایت آرامش و شادی به استراحت بپردازد اما",
                "تمام این معادلات را بر هم ریخته، عادت هایی که تا قبل از قرنطینه..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012614823/بگومگوهای-کرونایی",
              "@target": "_blank",
              "@title": "سه‌شنبه ۲۶ فروردین ۱۳۹۹ - ۰۹:۰۴",
              "span": "۲۶",
              "#text": "فروردین ۹۹ - ۹:۴"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99012413328/سیاه-نمایی-ها-مانع-اطلاع-مردم-از-دستاوردهای-دولت-شده-است",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/12/2/61612841.jpg",
              "@alt": "سیاه‌نمایی‌ها مانع اطلاع مردم از دستاوردهای دولت شده است"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99012413328/سیاه-نمایی-ها-مانع-اطلاع-مردم-از-دستاوردهای-دولت-شده-است",
              "@target": "_blank",
              "#text": "جهانگیری در جلسه معارفه وزیر جهاد کشاورزی:"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99012413328/سیاه-نمایی-ها-مانع-اطلاع-مردم-از-دستاوردهای-دولت-شده-است",
              "@target": "_blank",
              "#text": "سیاه‌نمایی‌ها مانع اطلاع مردم از دستاوردهای دولت شده است"
            }
          },
          "p": [
            "معاون اول رییس جمهور با تأکید بر اینکه امنیت غذایی یکی از مهمترین بخش‌های اقتصاد مقاومتی است گفت: وزارت جهاد کشاورزی دستاوردها و عملکرد بسیار خوبی در ایجاد امنیت غذایی کشور داشته و این وزارتخانه نماد واقعی اجرای سیاست‌های کلی اقتصاد مقاومتی بوده است.",
            {
              "em": [
                "حساسیت",
                "کرونا",
                "تفاوت"
              ],
              "#text": [
                "... و گفت:‌ باید",
                "ویژه ای بر این موضوع داشته باشیم چرا که ویروس",
                "سلامت مردم را هدف گرفته است و اولویت اصلی دولت... اقدامات و فعالیت های این وزارتخانه اظهار کرد: هیچ حکومتی نمی تواند نسبت به بخش کشاورزی بی",
                "باشد و تصور کند می تواند..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99012413328/سیاه-نمایی-ها-مانع-اطلاع-مردم-از-دستاوردهای-دولت-شده-است",
              "@target": "_blank",
              "@title": "یکشنبه ۲۴ فروردین ۱۳۹۹ - ۱۰:۴۴",
              "span": "۲۴",
              "#text": "فروردین ۹۹ - ۱۰:۴۴"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99011809516/نماینده-ولی-فقیه-در-سیستان-و-بلوچستان-حج-فرصتی-بزرگ-برای-وحدت",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/sb/2020/04/06/2/61608928.jpg",
              "@alt": "نماینده ولی فقیه در سیستان و بلوچستان: حج فرصتی بزرگ برای وحدت و تاکید بر مشترکات است"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99011809516/نماینده-ولی-فقیه-در-سیستان-و-بلوچستان-حج-فرصتی-بزرگ-برای-وحدت",
              "@target": "_blank",
              "#text": "نماینده ولی فقیه در سیستان و بلوچستان: حج فرصتی بزرگ بر��ی وحدت و تاکید بر مشترکات است"
            }
          },
          "p": [
            "نماینده ولی فقیه در استان سیستان و بلوچستان وامام جمعه زاهدان گفت: حج فرصتی بزرگ برای ایجاد وحدت در میان مسلمانان است و ما می بایست از این فرصت برای تاکید بر مشترکات خود بهره جویی کنیم.",
            {
              "em": [
                "تفاوت",
                "حساسیت",
                "کرونا"
              ],
              "#text": [
                "... بیان تبریک سال جدید و اعیاد شعبانیه اظهار داشت: در استان سیستان و بلوچستان با توجه به",
                "های قومی و مذهبی باید با",
                "... با توجه به مسئله شیوع ویروس",
                "کلیه مراحل ثبت نام به صورت اینترنتی بوده است. \r\nانتهای پیام..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99011809516/نماینده-ولی-فقیه-در-سیستان-و-بلوچستان-حج-فرصتی-بزرگ-برای-وحدت",
              "@target": "_blank",
              "@title": "دوشنبه ۱۸ فروردین ۱۳۹۹ - ۱۳:۱۷",
              "span": "۱۸",
              "#text": "فروردین ۹۹ - ۱۳:۱۷"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99011709048/بهره-مندی-۵۰-شرکت-از-تسهیلات-کرونایی-صندوق-نوآوری-تدابیر-حمایتی",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/04/05/2/61608534.jpg",
              "@alt": "بهره‌مندی ۵۰ شرکت از تسهیلات کرونایی صندوق نوآوری/تدابیر حمایتی از شرکت‌های متضرر در شرایط شیوع"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99011709048/بهره-مندی-۵۰-شرکت-از-تسهیلات-کرونایی-صندوق-نوآوری-تدابیر-حمایتی",
              "@target": "_blank",
              "#text": "در گفت‌وگو با ایسنا مطرح شد"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99011709048/بهره-مندی-۵۰-شرکت-از-تسهیلات-کرونایی-صندوق-نوآوری-تدابیر-حمایتی",
              "@target": "_blank",
              "#text": "بهره‌مندی ۵۰ شرکت از تسهیلات کرونایی صندوق نوآوری/تدابیر حمایتی از شرکت‌های متضرر در شرایط شیوع"
            }
          },
          "p": [
            {
              "em": "کرونا",
              "#text": "معاون توسعه فناوری صندوق نوآوری و شکوفایی از اختصاص تسهیلات کرونایی این صندوق به ۵۰ شرکت‌ خبر داد و گفت: صندوق ۵۰۰ میلیارد تومان اعتبار برای حمایت از شرکت‌های تولیدکننده محصولات مرتبط با شیوع"
            },
            {
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "...دکتر سیاوش ملکی‌فر در گفت‌وگو با ایسنا به بیان برنامه‌های حمایتی صندوق نوآوری و شکوفایی در مقابله با",
                "ویروس اشاره... کرد و گفت: برنامه‌های صندوق نوآوری و شکوفایی ریاست جمهوری برای مقابله با",
                "در ۴ محور طراحی و اجرا شد که شامل \"اعطای..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99011709048/بهره-مندی-۵۰-شرکت-از-تسهیلات-کرونایی-صندوق-نوآوری-تدابیر-حمایتی",
              "@target": "_blank",
              "@title": "دوشنبه ۱۸ فروردین ۱۳۹۹ - ۰۰:۲۱",
              "span": "۱۸",
              "#text": "فروردین ۹۹ - ۰:۲۱"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99011607567/شهروندان-تا-اطلاع-ثانوی-زباله-ها-را-تفکیک-نکنند",
            "img": {
              "@src": "https://cdn.isna.ir/d/off/orumiyeh/2020/04/04/2/61607391.jpg",
              "@alt": "شهروندان تا اطلاع ثانوی زباله ها را تفکیک نکنند"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h4": {
            "a": {
              "@href": "/news/99011607567/شهروندان-تا-اطلاع-ثانوی-زباله-ها-را-تفکیک-نکنند",
              "@target": "_blank",
              "#text": "رئیس سازمان مدیریت پسماند شهرداری ارومیه:"
            }
          },
          "h3": {
            "a": {
              "@href": "/news/99011607567/شهروندان-تا-اطلاع-ثانوی-زباله-ها-را-تفکیک-نکنند",
              "@target": "_blank",
              "#text": "شهروندان تا اطلاع ثانوی زباله ها را تفکیک نکنند"
            }
          },
          "p": [
            "رئیس سازمان مدیریت پسماند شهرداری ارومیه گفت: زباله های بیمارستانی ارومیه درجایگاه ویژه دفن می شوند.",
            {
              "em": [
                "حساسیت",
                "کرونا"
              ],
              "#text": [
                "...احدیوسفی در گفت وگو با ایسنا افزود: باتوجه به",
                "شرایط، یک جایگاه ویژه و خاص در سایت نازلو برای دفن زباله...",
                "است، تصریح کرد: زباله های بیمارستانی تفکیک شده حمل و با پودر آهک به روشهای بهداشتی دفن می شوند. \r\nرئیس سازمان مدیریت..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99011607567/شهروندان-تا-اطلاع-ثانوی-زباله-ها-را-تفکیک-نکنند",
              "@target": "_blank",
              "@title": "شنبه ۱۶ فروردین ۱۳۹۹ - ۰۹:۱۳",
              "span": "۱۶",
              "#text": "فروردین ۹۹ - ۹:۱۳"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99011205997/روند-کاهشی-بسیار-ملایم-کووید۱۹-در-کشور-امکان-بروز-نوسانات-کرونایی",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/03/31/2/61605286.jpg",
              "@alt": "روند کاهشی بسیار ملایم کووید۱۹ در کشور/امکان بروز نوسانات کرونایی در برخی استان‌ها"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99011205997/روند-کاهشی-بسیار-ملایم-کووید۱۹-در-کشور-امکان-بروز-نوسانات-کرونایی",
              "@target": "_blank",
              "#text": "روند کاهشی بسیار ملایم کووید۱۹ در کشور/امکان بروز نوسانات کرونایی در برخی استان‌ها"
            }
          },
          "p": [
            {
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "معاون درمان وزیر بهداشت ض��ن تشریح اقدامات انجام شده در زمینه",
                "، گفت: بعد از شناسایی",
                "در کشور، بلافاصله آن را اعلام کردیم و با امکاناتی که در قالب طرح تحول سلامت داشتیم، ۴۰ هزار تخت را برای"
              ]
            },
            {
              "em": [
                "کرونا",
                "کرونا",
                "تفاوت‌هایی"
              ],
              "#text": [
                "...",
                "را می‌شنوند. اولین مورد مثبت‌",
                "در کشورمان در قم بود که بنده آنجا حضور داشتم. ۲۹ بهمن ماه بود که موارد مشکوکی... را به ما گزارش و اعلام کردند که از نظر علائم بالینی با آنفلوآنزا",
                "دارد. بر این اساس ما با تیم عفونی به قم رفتیم و وقتی..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99011205997/روند-کاهشی-بسیار-ملایم-کووید۱۹-در-کشور-امکان-بروز-نوسانات-کرونایی",
              "@target": "_blank",
              "@title": "سه‌شنبه ۱۲ فروردین ۱۳۹۹ - ۱۲:۱۶",
              "span": "۱۲",
              "#text": "فروردین ۹۹ - ۱۲:۱۶"
            }
          }
        }
      },
      {
        "@class": "",
        "figure": {
          "a": {
            "@href": "/news/99011105518/تمدید-فاصله-گذاری-اجتماعی-در-کشور-تابع-وضعیت-شیوع-کرونا",
            "img": {
              "@src": "https://cdn.isna.ir/d/2020/03/24/2/61600915.jpg",
              "@alt": "تمدید فاصله‌گذاری اجتماعی در کشور تابع وضعیت شیوع کرونا"
            }
          }
        },
        "div": {
          "@class": "desc",
          "h3": {
            "a": {
              "@href": "/news/99011105518/تمدید-فاصله-گذاری-اجتماعی-در-کشور-تابع-وضعیت-شیوع-کرونا",
              "@target": "_blank",
              "em": "کرونا",
              "#text": "تمدید فاصله‌گذاری اجتماعی در کشور تابع وضعیت شیوع"
            }
          },
          "p": [
            "سخنگوی وزارت بهداشت گفت: امیدواریم که همانطور که بسیج ملی به خوبی موثر افتاد، بسیج جهانی هم به عنوان رویکردی در جهان پذیرفته شود و در روزهای آتی خبر خوش مهار و کنترل و حتی حذف بیماری را شاهد باشیم.",
            {
              "em": [
                "کرونا",
                "کرونا"
              ],
              "#text": [
                "... در استان‌های مختلف در بسیج ملی مقابله با",
                "که اقدامی بزرگ بود و با کمک بخش‌های مختلف اجرا شد، تا امروز بیش از ۶۳ میلیون نفر... به عنوان توصیه مطرح می‌کنیم، به ‌ویژه در تهران و البرز مشارکت بیشتر در بسیج ملی مقابله با",
                "و ثبت نام سامانه Salamat.gov.ir..."
              ]
            }
          ],
          "time": {
            "a": {
              "@href": "/news/99011105518/تمدید-فاصله-گذاری-اجتماعی-در-کشور-تابع-وضعیت-شیوع-کرونا",
              "@target": "_blank",
              "@title": "دوشنبه ۱۱ فروردین ۱۳۹۹ - ۱۴:۲۵",
              "span": "۱۱",
              "#text": "فروردین ۹۹ - ۱۴:۲۵"
            }
          }
        }
      }
    ]"""